//#include <stdio.h>
//#include <math.h>
//
//int main()
//{
	//char c='-';

	//switch (c) {
	//case '+': printf("+"); break;
	//case '-': printf("-"); break;
	//default:	printf("结束");
	//}

//一 .
//写代码将三个整数数按从大到小输出。
//例如：
//输入：2 3 1
//输出：3 2 1
	//int a = 0, b = 0, c = 0, temp = 0;
	//scanf("%d %d %d", &a, &b, &c);
	//if (a<b)
	//{
	//	temp = a;
	//	a = b;
	//	b = temp;
	//}
	// if (a<c)
	//{
	//	temp = a;
	//	a = c;
	//	c = temp;
	//}
	// if (b<c)
	//{
	//	temp = c;
	//	c = b;
	//	b = temp;
	//}
	//printf("%d %d %d", a, b, c);
	//return 0;


	//二.写一个代码打印1-100之间所有3的倍数的数字
	//int i = 1;

	//for (i; i <= 100; i++)
	//{
	//	if (0 == i % 3)
	//	{
	//		printf("%d,",i);
	//	}
	//}

	//三.
	//给定两个数，求这两个数的最大公约数
	//例如：
	//输入：20 40
	//输出：20
	//求最大公约数 判断了大小
	//int a=0, b=0,temp=0;
	//int r;
	//scanf("%d %d", &a, &b);
	//if (a <= b)
	//{
	//	temp = a;
	//	a = b;
	//	b = temp;
	//}	
	//r = a%b;
	//while (r != 0)
	//{
	//	a = b;
	//	b = r;
	//	r = a%b;
	//}
	//printf("%d\n", b);

	//不判断大小
	//int a = 0, b = 0;
	//int r;
	//scanf("%d %d", &a, &b);
	//while (r = a%b)
	//{
	//	a = b;
	//	b = r;
	//}
	//printf("%d\n", b);


#include<stdio.h>
	//相减法 
//int main()
//{
//	int a, b;
//	int c = 0;  //计数器 
//	while (1)  //循环判断的作用 
//	{
//		printf("输入两个数字求最大公约数:");
//		scanf("%d%d", &a, &b);
//		while (a != b)
//		{
//			if (a>b)
//				a = a - b;
//			else
//				b = b - a;
//			c++;
//		}
//		printf("最大公约数是:%d\n", a);
//		printf("%d\n", c);
//	}
//	return 0;
//}


//#include<stdio.h>
////穷举法 
//int main()
//{
//	int a, b, c;
//	int d = 0;//计数器 
//	while (1)
//	{
//		printf("输入两个数字求最大公约数:");
//		scanf("%d%d", &a, &b);
//		c = (a > b) ? b : a;//三目运算符 
//		//while (a%c != 0 || b%c != 0)
//		//{
//		//	c--;
//		//	d++;
//		//}
//
//		while (1)
//		{
//			if (a%c == 0 && b%c == 0)
//			{
//				printf("最大公约数是:%d\n", c);
//
//				printf("%d\n", d);
//				break;
//				
//			}
//			c--;
//			d++;
//		}
//		//printf("最大公约数是:%d\n", c);
//		//printf("%d\n", d);
//	}
//	return 0;
//}



	//四.打印1000年到2000年之间的闰年
	//int i = 1000;
	//判断闰年
	//for (i; i <= 2000; i++)
	//{
	//	if (0 == i % 4)
	//	{
	//		if (0 != i % 100)
	//		{
	//			printf("%d,", i);
	//		}
	//	}
	//	if (0 == i % 400)
	//	{
	//		printf("%d,", i);
	//	}
	//}

	//优化
	//int i = 1000;
	//for (i; i <= 2000; i++)
	//{
	//	if (0 == i % 4 && i % 100 != 0 || (0 == i % 400))
	//	{
	//		printf("%d,", i);
	//	}
	//}

	//五.
	//写一个代码：打印100~200之间的素数
	//计算质数
	//int i = 0, j = 0;


	//for (i = 101; i <= 200; i+=2)  //偶数无质数，没必要循环偶数
	//{
	//	for (j = 2; j <= sqrt(i); j++)
	//	{
	//		if (0 == i%j)
	//		{
	//			break;
	//		}
	//	}
	//	if (j > sqrt(i))
	//	{
	//		printf("%d,", i);
	//	}
	//}

	//第五题更多优质解析(答案)
	//
	//	/*
	//	思路：
	//	素数：即质数，除了1和自己之外，再没有其他的约数，则该数据为素数，具体方式如下
	//	*/
	//
	//
	//	//方法一：试除法
	//int main()
	//{
	//	int i = 0;
	//	int count = 0;
	//
	//
	//	// 外层循环用来获取100~200之间的所有数据，100肯定不是素数，因此i从101开始
	//	for (i = 101; i <= 200; i++)
	//	{
	//		//判断i是否为素数：用[2, i)之间的每个数据去被i除，只要有一个可以被整除，则不是素数
	//		int j = 0;
	//		for (j = 2; j<i; j++)
	//		{
	//			if (i%j == 0)
	//			{
	//				break;
	//			}
	//		}
	//
	//		// 上述循环结束之后，如果j和i相等，说明[2, i）之间的所有数据都不能被i整除，则i为素数
	//		if (j == i)
	//		{
	//			count++;
	//			printf("%d ", i);
	//		}
	//	}
	//
	//
	//	printf("\ncount = %d\n", count);
	//	return 0;
	//}
	//
	//
	////上述方法的缺陷：超过i一半的数据，肯定不是i的倍数，
	//上述进行了许多没有意义的运算，因此可以采用如下
	//// 方式进行优化
	//// 方法二：每拿到一个数据，只需要检测其：[2, i/2]区间内是否有元素可以被2i整除即可，
	//可以说明i不是素数
	//int main()
	//{
	//	int i = 0;//
	//	int count = 0;
	//
	//
	//	for (i = 101; i <= 200; i++)
	//	{
	//		//判断i是否为素数
	//		//2->i-1
	//		int j = 0;
	//		for (j = 2; j <= i / 2; j++)
	//		{
	//			if (i%j == 0)
	//			{
	//				break;
	//			}
	//		}
	//		//...
	//		if (j>i / 2)
	//		{
	//			count++;
	//			printf("%d ", i);
	//		}
	//	}
	//
	//
	//	printf("\ncount = %d\n", count);
	//	return 0;
	//}
	//
	//
	//
	//
	///*
	//方法二还是包含了一些重复的数据，再优化：
	//如果i能够被[2, sqrt(i)]之间的任意数据整除，则i不是素数
	//原因：如果 m 能被 2 ~ m-1 之间任一整数整除，其二个因子必定有一个小于或等于sqrt(m),
	//另一个大于或等于 sqrt(m)。
	//*/
	//int main()
	//{
	//	int i = 0;
	//	int count = 0;
	//
	//
	//	for (i = 101; i <= 200; i++)
	//	{
	//		//判断i是否为素数
	//		//2->i-1
	//		int j = 0;
	//		for (j = 2; j <= sqrt(i); j++)
	//		{
	//			if (i%j == 0)
	//			{
	//				break;
	//			}
	//		}
	//		//...
	//		if (j>sqrt(i))
	//		{
	//			count++;
	//			printf("%d ", i);
	//		}
	//	}
	//
	//
	//	printf("\ncount = %d\n", count);
	//	return 0;
	//}
	//
	//
	////方法4
	///*
	//继续对方法三优化，只要i不被[2, sqrt(i)]之间的任何数据整除，则i是素数，
	//但是实际在操作时i不用从101逐渐递增到200，因为出了2和3之外，
	//不会有两个连续相邻的数据同时为素数
	//*/
	//
	//
	//int main()
	//{
	//	int i = 0;
	//	int count = 0;
	//
	//
	//	for (i = 101; i <= 200; i += 2)
	//	{
	//		//判断i是否为素数
	//		//2->i-1
	//		int j = 0;
	//		for (j = 2; j <= sqrt(i); j++)
	//		{
	//			if (i%j == 0)
	//			{
	//				break;
	//			}
	//		}
	//		//...
	//		if (j>sqrt(i))
	//		{
	//			count++;
	//			printf("%d ", i);
	//		}
	//	}
	//
	//	printf("\ncount = %d\n", count);
	//	return 0;
	//}


//}